from ninja import Schema
from datetime import datetime
from typing import Optional


# Роутер для аутентифікації



class TaskIn(Schema):
    """
    Схема вхідних даних для створення або оновлення об'єкта Task.

    Ця схема використовується для валідації даних, отриманих від клієнта
    у тілі POST або PUT запиту.
    """
    title: str
    """ Назва завдання (обов'язкове поле). """

    description: Optional[str] = None
    """Опис завдання (необов'язкове поле)."""

    status: str = 'TODO'
    """
    Поточний статус завдання. 
    За замовчуванням встановлено 'TODO'.
    """

    due_date: Optional[datetime] = None
    """
    Кінцевий термін виконання завдання (опціонально).
    Очікується об'єкт datetime.
    """


class TaskOut(Schema):
    """
    Схема вихідних даних для представлення об'єкта Task у відповіді API.

    Ця схема визначає, які поля моделі Task будуть серіалізовані
    та надіслані назад клієнту.
    """
    id: int
    """Унікальний ідентифікатор завдання."""

    title: str
    """Назва завдання."""

    description: Optional[str] = None
    """Опис завдання."""

    status: str
    """Поточний статус завдання."""

    created_at: datetime
    """Дата та час створення завдання."""

    due_date: Optional[datetime] = None
    """Кінцевий термін виконання завдання."""

    user_id: int
    """ID користувача, якому належить завдання (Зовнішній ключ)."""
